{
  "basics": {
    "name": "Justin Jasper",
    "label": "Computational Biologist, AI Researcher",
    "image": "",
    "email": "jtjasper@stanford.edu",
    "phone": "(770) 480-8093",
    "url": "https://justinjasper.github.io",
    "summary": "Deeply passionate about leveraging the intersection of computational biology and machine learning to tackle complex challenges in biomedical research and development.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Palo Alto",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Justin Jasper",
        "url": "https://www.linkedin.com/in/justin-jasper/"
      }
    ]
  },
  "work": [
    {
      "name": "Mclean, Virginia",
      "position": "Computational Biology Intern - MITRE Corporation",
      "url": "https://www.mitre.org/our-impact/mitre-labs/emerging-technology-innovation-center/biotechnology-and-life-sciences",
      "startDate": "06-2024",
      "endDate": "Present",
      "summary": "",
      "highlights": [
        "Developed automation software to optimize high-throughput training and fine-tuning processes for open-source large language models (LLMs).",
        "Developed an LLM-driven retrieval augmented generation system to extract and summarize key insights from complex scientific literature, streamlining knowledge access for synthetic biology workflows (Used scientific python, LangChain, LlamaIndex, Kubernetes).",
        "Developed the BioNet Domain-Specific Language, an open-source programming language designed to enable extensive scaling of synthetic biology experiments and industrial workflows."
      ]
    },
    {
      "name": "Palo Alto, California",
      "position": "Co-Founder, CEO - Omniwear AI",
      "url": "https://www.tryomniwear.com/",
      "startDate": "12-2022",
      "endDate": "12-2023",
      "summary": "",
      "highlights": [
        "Led the development of a cutting-edge B2B virtual try-on platform for e-commerce powered by computer vision and generative AI, catering specifically to the D2C retail clothing sector.",
        "Spearheaded the B2B growth strategy, successfully acquiring early customer brands. Notably, secured partnerships with a retail giant valued at over <span>$1 billion</span> and a retailer valued at around <span>$250 million</span>",
        "Established and maintained direct communication channels with corporate executives, ensuring seamless collaboration and addressing clients' unique needs and concerns.",
        "Participated in Launchpad (Stanford’s premier graduate accelerator) Spring ‘23 and Entrepreneur First’s NYC unicorn training program."
      ]
    }
  ],
  "education": [
    {
      "institution": "Stanford University",
      "location": "Palo Alto, CA",
      "url": "https://www.stanford.edu/",
      "area": "",
      "studyType": "M.S. Computer Science - Artificial Intelligence",
      "startDate": "01-2025",
      "endDate": "06-2026",
      "courses": [
        "Artificial Intelligence: Principles and Techniques",
        "Translational Bioinformatics",
        "Computational Biology: Structure and Organization of Biomolecules and Cells"
      ]
    },
    {
      "institution": "Stanford University",
      "location": "Palo Alto, CA",
      "url": "https://www.stanford.edu/",
      "area": "",
      "studyType": "B.S. Bioengineering",
      "startDate": "09-2021",
      "endDate": "06-2025",
      "courses": [
        "Biochemistry & Molecular Biology",
        "Physical Biology of Cells",
        "Systems Physiology and Design",
        "Fundamentals for Engineering Biology Lab",
        "Biomedical System Prototyping Lab"
      ]
    }
  ],
  "skills": [
    {
      "name": "Computational",
      "level": "Advanced",
      "keywords": [
        "Languages: Python, C++, C, MATLAB, UNIX",
        "Frameworks: TensorFlow, LangChain, LlamaIndex, Scikit-learn",
        "Libraries: Numpy, Pandas, OpenCV",
        "AI/ML: Deep Learning, Bayesian Statistics, LLM Training & Deployment"
      ]
    },
    {
      "name": "Wet Lab",
      "level": "Proficient",
      "keywords": [
        "Cell Cultures: Mammalian Cell Cultures, Bacterial Cultures",
        "Molecular Biology Techniques: PCR, Gel Electrophoresis, Transfections",
        "Analytical Techniques: Chromatography, Cell Blotting, Flow Cytometry"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Spanish",
      "fluency": "Proficient"
    }
  ],
  "projects": [
    {
      "name": "CV Image Processing for CT and Ultrasound-based Tumor Detection",
      "summary": "",
      "highlights": [
        "Developed a computer vision pipeline for lung CT scans using Python and OpenCV.",
        "Achieved high accuracy in tumor segmentation using an Attention U-Net model.",
        "Implemented K-means clustering for lung tissue classification."
      ],
      "startDate": "03-2024",
      "endDate": "03-2024"
      
    },
    {
      "name": "CV Image Processing for Meal Nutritional Analysis",
      "summary": "",
      "highlights": [
        "Developed a computer vision (CV)-based web application that detects and classifies food items from user-uploaded images.",
        "Trained a ResNet18 convolutional neural network model on a Food image dataset from Kaggle (using Tensorflow).",
        "Implemented an object detection pipeline to localize and identify food items before classification.",
        "Built a full-stack web interface using HTML (frontend) and a Python Flask backend to allow users to upload images for real-time food classification."
      ],
      "startDate": "01-2025",
      "endDate": "01-2025",
      "url": "https://github.com/justinjasper/meal-calorie-predictor"
    },
    {
      "name": "Computational Analysis of NMDA Receptor Antagonist Binding for Chronic Pain Therapeutics",
      "summary": "",
      "highlights": [
        "Investigated the molecular interactions between NMDA receptor antagonists and their binding sites using molecular docking simulations with SwissDock and AutoDock Vina.",
        "Designed and optimized docking workflows, refining model parameters to maximize accuracy in predicting ligand-receptor interactions.",
        "Quantified binding affinities to assess antagonist efficacy, providing computational insights for drug repurposing in chronic pain management."
        
      ],
      "startDate": "12-2024",
      "endDate": "12-2024",
      "url": ""
    },
    {
      "name": "Custom Heap Allocator (Memory Management & Systems Programming)",
      "summary": "",
      "highlights": [
        "Designed and implemented a custom heap allocator in C, featuring both implicit and explicit free lists for dynamic memory allocation.",
        "Optimized memory utilization and allocation efficiency by integrating block coalescing, splitting, and best-fit/free-list strategies.",
        "Implemented a custom malloc, free, realloc, and calloc, improving memory allocation speed and fragmentation handling."
        
      ],
      "startDate": "02-2024",
      "endDate": "02-2024",
      "url": ""
    },
    {
      "name": "Synthetic Biosensor Development for Pathogen Detection",
      "summary": "",
      "highlights": [
        "Engineered a novel biosensor using SynNotch receptors for Salmonella detection.",
        "Optimized receptor expression using flow cytometry and Western blotting.",
        "Utilized PCR, gel electrophoresis, and mammalian cell cultures."
      ],
      "startDate": "05-2023",
      "endDate": "05-2023",
      "url": ""
    }
  ]
}